/* 
    http://kancolle-calc.net/deckbuilder.html 様より失敬
*/
export interface EquipType {
	name: string,
	type: number[],
	seek: number
}

/** 基地系は除外 */
const equip_datas: Record<number, EquipType> = {
1:{"name":"12cm単装砲","type":[1,1,1,1,0],"seek":0}
,2:{"name":"12.7cm連装砲","type":[1,1,1,1,0],"seek":0}
,3:{"name":"10cm連装高角砲","type":[1,1,1,16,0],"seek":0}
,4:{"name":"14cm単装砲","type":[1,1,2,2,0],"seek":0}
,5:{"name":"15.5cm三連装砲","type":[1,1,2,2,0],"seek":0}
,6:{"name":"20.3cm連装砲","type":[1,1,2,2,0],"seek":0}
,7:{"name":"35.6cm連装砲","type":[1,1,3,3,0],"seek":0}
,8:{"name":"41cm連装砲","type":[1,1,3,3,0],"seek":0}
,9:{"name":"46cm三連装砲","type":[1,1,3,3,0],"seek":0}
,10:{"name":"12.7cm連装高角砲","type":[1,2,4,16,0],"seek":0}
,11:{"name":"15.2cm単装砲","type":[1,2,4,4,0],"seek":0}
,12:{"name":"15.5cm三連装副砲","type":[1,2,4,4,0],"seek":0}
,13:{"name":"61cm三連装魚雷","type":[2,3,5,5,0],"seek":0}
,14:{"name":"61cm四連装魚雷","type":[2,3,5,5,0],"seek":0}
,15:{"name":"61cm四連装(酸素)魚雷","type":[2,3,5,5,0],"seek":0}
,16:{"name":"九七式艦攻","type":[3,5,8,8,1],"seek":1}
,17:{"name":"天山","type":[3,5,8,8,1],"seek":1}
,18:{"name":"流星","type":[3,5,8,8,33],"seek":1}
,19:{"name":"九六式艦戦","type":[3,5,6,6,11],"seek":0}
,20:{"name":"零式艦戦21型","type":[3,5,6,6,11],"seek":0}
,21:{"name":"零式艦戦52型","type":[3,5,6,6,12],"seek":0}
,22:{"name":"試製烈風 後期型","type":[3,5,6,6,13],"seek":0}
,23:{"name":"九九式艦爆","type":[3,5,7,7,15],"seek":0}
,24:{"name":"彗星","type":[3,5,7,7,16],"seek":0}
,25:{"name":"零式水上偵察機","type":[5,7,10,10,2],"seek":5}
,26:{"name":"瑞雲","type":[5,43,11,10,32],"seek":6}
,27:{"name":"13号対空電探","type":[5,8,12,11,0],"seek":3}
,28:{"name":"22号対水上電探","type":[5,8,12,11,0],"seek":5}
,29:{"name":"33号対水上電探","type":[5,8,12,11,0],"seek":7}
,30:{"name":"21号対空電探","type":[5,8,13,11,0],"seek":4}
,31:{"name":"32号対水上電探","type":[5,8,13,11,0],"seek":10}
,32:{"name":"42号対空電探","type":[5,8,13,11,0],"seek":5}
,33:{"name":"改良型艦本式タービン","type":[6,31,17,19,0],"seek":0}
,34:{"name":"強化型艦本式缶","type":[6,31,17,19,0],"seek":0}
,35:{"name":"三式弾","type":[4,28,18,12,0],"seek":0}
,36:{"name":"九一式徹甲弾","type":[4,25,19,13,0],"seek":0}
,37:{"name":"7.7mm機銃","type":[4,6,21,15,0],"seek":0}
,38:{"name":"12.7mm単装機銃","type":[4,6,21,15,0],"seek":0}
,39:{"name":"25mm連装機銃","type":[4,6,21,15,0],"seek":0}
,40:{"name":"25mm三連装機銃","type":[4,6,21,15,0],"seek":0}
,41:{"name":"甲標的 甲型","type":[2,4,22,5,0],"seek":0}
,42:{"name":"応急修理要員","type":[6,30,23,14,0],"seek":0}
,43:{"name":"応急修理女神","type":[6,30,23,14,0],"seek":0}
,44:{"name":"九四式爆雷投射機","type":[7,32,15,17,0],"seek":0}
,45:{"name":"三式爆雷投射機","type":[7,32,15,17,0],"seek":0}
,46:{"name":"九三式水中聴音機","type":[7,10,14,18,0],"seek":0}
,47:{"name":"三式水中探信儀","type":[7,10,14,18,0],"seek":0}
,48:{"name":"12cm単装高角砲","type":[1,1,1,16,0],"seek":0}
,49:{"name":"25mm単装機銃","type":[4,6,21,15,0],"seek":0}
,50:{"name":"20.3cm(3号)連装砲","type":[1,1,2,2,0],"seek":0}
,51:{"name":"12cm30連装噴進砲","type":[4,29,21,15,0],"seek":0}
,52:{"name":"流星改","type":[3,5,8,8,33],"seek":2}
,53:{"name":"烈風 一一型","type":[3,5,6,6,13],"seek":0}
,54:{"name":"彩雲","type":[5,7,9,9,1],"seek":9}
,55:{"name":"紫電改二","type":[3,5,6,6,12],"seek":0}
,56:{"name":"震電改","type":[3,5,6,6,20],"seek":0}
,57:{"name":"彗星一二型甲","type":[3,5,7,7,16],"seek":1}
,58:{"name":"61cm五連装(酸素)魚雷","type":[2,3,5,5,0],"seek":0}
,59:{"name":"零式水上観測機","type":[5,7,10,10,2],"seek":6}
,60:{"name":"零式艦戦62型(爆戦)","type":[3,5,7,7,12],"seek":0}
,61:{"name":"二式艦上偵察機","type":[5,7,9,9,1],"seek":7}
,62:{"name":"試製晴嵐","type":[5,43,11,10,2],"seek":6}
,63:{"name":"12.7cm連装砲B型改二","type":[1,1,1,1,0],"seek":0}
,64:{"name":"Ju87C改","type":[3,5,7,7,14],"seek":0}
,65:{"name":"15.2cm連装砲","type":[1,1,2,2,0],"seek":0}
,66:{"name":"8cm高角砲","type":[1,2,4,16,0],"seek":0}
,67:{"name":"53cm艦首(酸素)魚雷","type":[2,3,5,5,0],"seek":0}
,68:{"name":"大発動艇","type":[8,14,24,20,0],"seek":0}
,69:{"name":"カ号観測機","type":[3,15,25,21,53],"seek":0}
,70:{"name":"三式指揮連絡機(対潜)","type":[3,16,26,22,54],"seek":1}
,71:{"name":"10cm連装高角砲(砲架)","type":[1,2,4,16,0],"seek":0}
,72:{"name":"増設バルジ(中型艦)","type":[6,17,27,23,0],"seek":0}
,73:{"name":"増設バルジ(大型艦)","type":[6,17,28,23,0],"seek":0}
,74:{"name":"探照灯","type":[8,18,29,24,0],"seek":2}
,75:{"name":"ドラム缶(輸送用)","type":[9,19,30,25,0],"seek":0}
,76:{"name":"38cm連装砲","type":[1,1,3,3,0],"seek":0}
,77:{"name":"15cm連装副砲","type":[1,2,4,4,0],"seek":0}
,78:{"name":"12.7cm単装砲","type":[1,1,1,1,0],"seek":0}
,79:{"name":"瑞雲(六三四空)","type":[5,43,11,10,32],"seek":6}
,80:{"name":"瑞雲12型","type":[5,43,11,10,32],"seek":6}
,81:{"name":"瑞雲12型(六三四空)","type":[5,43,11,10,32],"seek":7}
,82:{"name":"九七式艦攻(九三一空)","type":[3,5,8,8,1],"seek":2}
,83:{"name":"天山(九三一空)","type":[3,5,8,8,1],"seek":2}
,84:{"name":"2cm 四連装FlaK 38","type":[4,6,21,15,0],"seek":0}
,85:{"name":"3.7cm FlaK M42","type":[4,6,21,15,0],"seek":0}
,86:{"name":"艦艇修理施設","type":[10,20,31,26,0],"seek":0}
,87:{"name":"新型高温高圧缶","type":[6,31,17,19,0],"seek":0}
,88:{"name":"22号対水上電探改四","type":[5,8,12,11,0],"seek":5}
,89:{"name":"21号対空電探改","type":[5,8,13,11,0],"seek":6}
,90:{"name":"20.3cm(2号)連装砲","type":[1,1,2,2,0],"seek":0}
,91:{"name":"12.7cm連装高角砲(後期型)","type":[1,2,1,16,0],"seek":0}
,92:{"name":"毘式40mm連装機銃","type":[4,6,21,15,0],"seek":0}
,93:{"name":"九七式艦攻(友永隊)","type":[3,5,8,8,1],"seek":4}
,94:{"name":"天山一二型(友永隊)","type":[3,5,8,8,1],"seek":5}
,95:{"name":"潜水艦53cm艦首魚雷(8門)","type":[2,3,32,5,0],"seek":0}
,96:{"name":"零式艦戦21型(熟練)","type":[3,5,6,6,11],"seek":1}
,97:{"name":"九九式艦爆(熟練)","type":[3,5,7,7,15],"seek":2}
,98:{"name":"九七式艦攻(熟練)","type":[3,5,8,8,1],"seek":2}
,99:{"name":"九九式艦爆(江草隊)","type":[3,5,7,7,40],"seek":3}
,100:{"name":"彗星(江草隊)","type":[3,5,7,7,16],"seek":4}
,101:{"name":"照明弾","type":[11,21,33,27,0],"seek":0}
,102:{"name":"九八式水上偵察機(夜偵)","type":[5,7,10,50,2],"seek":3}
,103:{"name":"試製35.6cm三連装砲","type":[1,1,3,3,0],"seek":0}
,104:{"name":"35.6cm連装砲(ダズル迷彩)","type":[1,1,3,3,0],"seek":0}
,105:{"name":"試製41cm三連装砲","type":[1,1,3,3,0],"seek":0}
,106:{"name":"13号対空電探改","type":[5,8,12,11,0],"seek":4}
,107:{"name":"艦隊司令部施設","type":[12,22,34,28,0],"seek":1}
,108:{"name":"熟練艦載機整備員","type":[13,23,35,29,0],"seek":1}
,109:{"name":"零戦52型丙(六〇一空)","type":[3,5,6,6,13],"seek":0}
,110:{"name":"烈風(六〇一空)","type":[3,5,6,6,13],"seek":0}
,111:{"name":"彗星(六〇一空)","type":[3,5,7,7,16],"seek":1}
,112:{"name":"天山(六〇一空)","type":[3,5,8,8,1],"seek":2}
,113:{"name":"流星(六〇一空)","type":[3,5,8,8,17],"seek":3}
,114:{"name":"38cm連装砲改","type":[1,1,3,3,0],"seek":0}
,115:{"name":"Ar196改","type":[5,7,10,10,2],"seek":5}
,116:{"name":"一式徹甲弾","type":[4,25,19,13,0],"seek":0}
,117:{"name":"試製46cm連装砲","type":[1,1,3,3,0],"seek":0}
,118:{"name":"紫雲","type":[5,7,10,10,2],"seek":8}
,119:{"name":"14cm連装砲","type":[1,1,2,2,0],"seek":0}
,120:{"name":"91式高射装置","type":[14,24,36,30,0],"seek":0}
,121:{"name":"94式高射装置","type":[14,24,36,30,0],"seek":0}
,122:{"name":"10cm連装高角砲+高射装置","type":[1,1,1,16,0],"seek":0}
,123:{"name":"SKC34 20.3cm連装砲","type":[1,1,2,2,0],"seek":0}
,124:{"name":"FuMO25 レーダー","type":[5,8,13,11,0],"seek":9}
,125:{"name":"61cm三連装(酸素)魚雷","type":[2,3,5,5,0],"seek":0}
,126:{"name":"WG42 (Wurfgerät 42)","type":[15,26,37,31,0],"seek":0}
,127:{"name":"試製FaT仕様九五式酸素魚雷改","type":[2,3,32,5,0],"seek":0}
,128:{"name":"試製51cm連装砲","type":[1,1,3,3,0],"seek":0}
,129:{"name":"熟練見張員","type":[16,27,39,32,0],"seek":2}
,130:{"name":"12.7cm高角砲+高射装置","type":[1,2,4,16,0],"seek":0}
,131:{"name":"25mm三連装機銃 集中配備","type":[4,6,21,15,0],"seek":0}
,132:{"name":"零式水中聴音機","type":[7,10,40,18,0],"seek":1}
,133:{"name":"381mm/50 三連装砲","type":[1,1,3,3,0],"seek":0}
,134:{"name":"OTO 152mm三連装速射砲","type":[1,2,4,4,0],"seek":0}
,135:{"name":"90mm単装高角砲","type":[1,2,4,16,0],"seek":0}
,136:{"name":"プリエーゼ式水中防御隔壁","type":[6,17,28,23,0],"seek":0}
,137:{"name":"381mm/50 三連装砲改","type":[1,1,3,3,0],"seek":0}
,138:{"name":"二式大艇","type":[17,33,41,33,19],"seek":12}
,139:{"name":"15.2cm連装砲改","type":[1,1,2,2,0],"seek":0}
,140:{"name":"96式150cm探照灯","type":[8,18,42,24,0],"seek":3}
,141:{"name":"32号対水上電探改","type":[5,8,13,11,0],"seek":11}
,142:{"name":"15m二重測距儀+21号電探改二","type":[5,8,13,11,0],"seek":7}
,143:{"name":"九七式艦攻(村田隊)","type":[3,5,8,8,1],"seek":4}
,144:{"name":"天山一二型(村田隊)","type":[3,5,8,8,1],"seek":4}
,145:{"name":"戦闘糧食","type":[18,34,43,34,0],"seek":0}
,146:{"name":"洋上補給","type":[19,35,44,35,0],"seek":0}
,147:{"name":"120mm/50 連装砲","type":[1,1,1,1,0],"seek":0}
,148:{"name":"試製南山","type":[3,5,7,7,24],"seek":2}
,149:{"name":"四式水中聴音機","type":[7,10,14,18,0],"seek":0}
,150:{"name":"秋刀魚の缶詰","type":[18,34,43,34,0],"seek":0}
,151:{"name":"試製景雲(艦偵型)","type":[5,7,9,9,1],"seek":11}
,152:{"name":"零式艦戦52型(熟練)","type":[3,5,6,6,12],"seek":1}
,153:{"name":"零戦52型丙(付岩井小隊)","type":[3,5,6,6,12],"seek":1}
,154:{"name":"零戦62型(爆戦/岩井隊)","type":[3,5,7,7,12],"seek":1}
,155:{"name":"零戦21型(付岩本小隊)","type":[3,5,6,6,11],"seek":1}
,156:{"name":"零戦52型甲(付岩本小隊)","type":[3,5,6,6,12],"seek":1}
,157:{"name":"零式艦戦53型(岩本隊)","type":[3,5,6,6,12],"seek":3}
,158:{"name":"Bf109T改","type":[3,5,6,6,14],"seek":0}
,159:{"name":"Fw190T改","type":[3,5,6,6,37],"seek":0}
,160:{"name":"10.5cm連装砲","type":[1,2,4,16,0],"seek":0}
,161:{"name":"16inch三連装砲 Mk.7","type":[1,1,3,3,0],"seek":0}
,162:{"name":"203mm/53 連装砲","type":[1,1,2,2,0],"seek":0}
,163:{"name":"Ro.43水偵","type":[5,7,10,10,25],"seek":4}
,164:{"name":"Ro.44水上戦闘機","type":[5,36,45,43,25],"seek":2}
,165:{"name":"二式水戦改","type":[5,36,45,43,3],"seek":1}
,166:{"name":"大発動艇(八九式中戦車&陸戦隊)","type":[8,14,24,20,0],"seek":0}
,167:{"name":"特二式内火艇","type":[20,37,46,36,0],"seek":0}
,171:{"name":"OS2U","type":[5,7,10,10,43],"seek":6}
,172:{"name":"5inch連装砲 Mk.28 mod.2","type":[1,2,4,16,0],"seek":0}
,173:{"name":"Bofors 40mm四連装機関砲","type":[4,6,21,15,0],"seek":0}
,174:{"name":"53cm連装魚雷","type":[2,3,5,5,0],"seek":0}
,178:{"name":"PBY-5A Catalina","type":[17,33,41,33,19],"seek":9}
,179:{"name":"試製61cm六連装(酸素)魚雷","type":[2,3,5,5,0],"seek":0}
,181:{"name":"零式艦戦32型","type":[3,5,6,6,11],"seek":0}
,182:{"name":"零式艦戦32型(熟練)","type":[3,5,6,6,11],"seek":0}
,183:{"name":"16inch三連装砲 Mk.7+GFCS","type":[1,1,3,3,0],"seek":0}
,184:{"name":"Re.2001 OR改","type":[3,5,6,6,14],"seek":0}
,188:{"name":"Re.2001 G改","type":[3,5,8,8,14],"seek":0}
,189:{"name":"Re.2005 改","type":[3,5,6,6,14],"seek":0}
,190:{"name":"38.1cm Mk.I連装砲","type":[1,1,3,3,0],"seek":0}
,191:{"name":"QF 2ポンド8連装ポンポン砲","type":[4,6,21,15,0],"seek":0}
,192:{"name":"38.1cm Mk.I/N連装砲改","type":[1,1,3,3,0],"seek":0}
,193:{"name":"特大発動艇","type":[8,14,24,20,0],"seek":0}
,194:{"name":"Laté 298B","type":[5,43,11,10,14],"seek":4}
,195:{"name":"SBD","type":[3,5,7,7,21],"seek":2}
,196:{"name":"TBD","type":[3,5,8,8,21],"seek":2}
,197:{"name":"F4F-3","type":[3,5,6,6,21],"seek":0}
,198:{"name":"F4F-4","type":[3,5,6,6,21],"seek":1}
,199:{"name":"噴式景雲改","type":[3,40,57,39,22],"seek":3}
,200:{"name":"橘花改","type":[3,40,57,40,23],"seek":0}
,203:{"name":"艦本新設計 増設バルジ(中型艦)","type":[6,17,27,23,0],"seek":0}
,204:{"name":"艦本新設計 増設バルジ(大型艦)","type":[6,17,28,23,0],"seek":0}
,205:{"name":"F6F-3","type":[3,5,6,6,21],"seek":1}
,206:{"name":"F6F-5","type":[3,5,6,6,21],"seek":1}
,207:{"name":"瑞雲(六三一空)","type":[5,43,11,10,24],"seek":4}
,208:{"name":"晴嵐(六三一空)","type":[5,43,11,10,2],"seek":6}
,209:{"name":"彩雲(輸送用分解済)","type":[23,41,50,41,0],"seek":0}
,210:{"name":"潜水艦搭載電探&水防式望遠鏡","type":[24,42,51,42,0],"seek":4}
,211:{"name":"潜水艦搭載電探&逆探(E27)","type":[24,42,51,42,0],"seek":5}
,212:{"name":"彩雲(東カロリン空)","type":[5,7,9,9,1],"seek":10}
,213:{"name":"後期型艦首魚雷(6門)","type":[2,3,32,5,0],"seek":0}
,214:{"name":"熟練聴音員+後期型艦首魚雷(6門)","type":[2,3,32,5,0],"seek":1}
,215:{"name":"Ro.44水上戦闘機bis","type":[5,36,45,43,25],"seek":3}
,216:{"name":"二式水戦改(熟練)","type":[5,36,45,43,3],"seek":1}
,217:{"name":"強風改","type":[5,36,45,43,26],"seek":1}
,219:{"name":"零式艦戦63型(爆戦)","type":[3,5,7,7,12],"seek":0}
,220:{"name":"8cm高角砲改+増設機銃","type":[1,2,4,16,0],"seek":0}
,226:{"name":"九五式爆雷","type":[7,32,15,17,0],"seek":0}
,227:{"name":"二式爆雷","type":[7,32,15,17,0],"seek":0}
,228:{"name":"九六式艦戦改","type":[3,5,6,6,1],"seek":0}
,229:{"name":"12.7cm単装高角砲(後期型)","type":[1,1,1,16,0],"seek":0}
,230:{"name":"特大発動艇+戦車第11連隊","type":[8,14,24,20,0],"seek":0}
,231:{"name":"30.5cm三連装砲","type":[1,1,3,3,0],"seek":0}
,232:{"name":"30.5cm三連装砲改","type":[1,1,3,3,0],"seek":0}
,233:{"name":"F4U-1D","type":[3,5,7,7,46],"seek":1}
,234:{"name":"15.5cm三連装副砲改","type":[1,2,4,4,0],"seek":0}
,235:{"name":"15.5cm三連装砲改","type":[1,1,2,2,0],"seek":0}
,236:{"name":"41cm三連装砲改","type":[1,1,3,3,0],"seek":0}
,237:{"name":"瑞雲(六三四空/熟練)","type":[5,43,11,10,32],"seek":7}
,238:{"name":"零式水上偵察機11型乙","type":[5,7,10,10,2],"seek":6}
,239:{"name":"零式水上偵察機11型乙(熟練)","type":[5,7,10,10,2],"seek":8}
,240:{"name":"22号対水上電探改四(後期調整型)","type":[5,8,12,11,0],"seek":7}
,241:{"name":"戦闘糧食(特別なおにぎり)","type":[18,34,43,34,0],"seek":0}
,242:{"name":"Swordfish","type":[3,5,8,8,28],"seek":1}
,243:{"name":"Swordfish Mk.II(熟練)","type":[3,5,8,8,28],"seek":2}
,244:{"name":"Swordfish Mk.III(熟練)","type":[3,5,8,8,28],"seek":5}
,245:{"name":"38cm四連装砲","type":[1,1,3,3,0],"seek":0}
,246:{"name":"38cm四連装砲改","type":[1,1,3,3,0],"seek":0}
,247:{"name":"15.2cm三連装砲","type":[1,2,4,4,0],"seek":0}
,248:{"name":"Skua","type":[3,5,7,7,14],"seek":0}
,249:{"name":"Fulmar","type":[3,5,6,6,14],"seek":1}
,252:{"name":"Seafire Mk.III改","type":[3,5,6,6,29],"seek":0}
,254:{"name":"F6F-3N","type":[3,5,6,45,21],"seek":2}
,255:{"name":"F6F-5N","type":[3,5,6,45,21],"seek":3}
,256:{"name":"TBF","type":[3,5,8,8,21],"seek":2}
,257:{"name":"TBM-3D","type":[3,5,8,46,21],"seek":4}
,258:{"name":"夜間作戦航空要員","type":[13,23,35,29,0],"seek":0}
,259:{"name":"夜間作戦航空要員+熟練甲板員","type":[13,23,35,29,0],"seek":0}
,260:{"name":"Type124 ASDIC","type":[7,10,14,18,0],"seek":0}
,261:{"name":"Type144/147 ASDIC","type":[7,10,14,18,0],"seek":0}
,262:{"name":"HF/DF + Type144/147 ASDIC","type":[7,10,14,18,0],"seek":2}
,266:{"name":"12.7cm連装砲C型改二","type":[1,1,1,1,0],"seek":0}
,267:{"name":"12.7cm連装砲D型改二","type":[1,1,1,1,0],"seek":0}
,268:{"name":"北方迷彩(+北方装備)","type":[6,17,27,23,0],"seek":0}
,271:{"name":"紫電改四","type":[3,5,6,6,12],"seek":0}
,272:{"name":"遊撃部隊 艦隊司令部","type":[12,22,34,28,0],"seek":1}
,273:{"name":"彩雲(偵四)","type":[5,7,9,9,1],"seek":10}
,274:{"name":"12cm30連装噴進砲改二","type":[4,29,21,15,0],"seek":0}
,275:{"name":"10cm連装高角砲改+増設機銃","type":[1,2,4,16,0],"seek":0}
,276:{"name":"46cm三連装砲改","type":[1,1,3,3,0],"seek":0}
,277:{"name":"FM-2","type":[3,5,7,7,21],"seek":0}
,278:{"name":"SK レーダー","type":[5,8,13,11,0],"seek":10}
,279:{"name":"SK+SG レーダー","type":[5,8,13,11,0],"seek":12}
,280:{"name":"QF 4.7inch砲 Mk.XII改","type":[1,1,1,1,0],"seek":0}
,281:{"name":"51cm連装砲","type":[1,1,3,3,0],"seek":0}
,282:{"name":"130mm B-13連装砲","type":[1,1,1,1,0],"seek":0}
,283:{"name":"533mm 三連装魚雷","type":[2,3,5,5,0],"seek":0}
,284:{"name":"5inch単装砲 Mk.30","type":[1,1,1,16,0],"seek":0}
,285:{"name":"61cm三連装(酸素)魚雷後期型","type":[2,3,5,5,0],"seek":0}
,286:{"name":"61cm四連装(酸素)魚雷後期型","type":[2,3,5,5,0],"seek":0}
,287:{"name":"三式爆雷投射機 集中配備","type":[7,32,15,17,0],"seek":0}
,288:{"name":"試製15cm9連装対潜噴進砲","type":[7,32,15,17,0],"seek":0}
,289:{"name":"35.6cm三連装砲改(ダズル迷彩仕様)","type":[1,1,3,3,0],"seek":0}
,290:{"name":"41cm三連装砲改二","type":[1,1,3,3,0],"seek":0}
,291:{"name":"彗星二二型(六三四空)","type":[3,5,7,7,16],"seek":0}
,292:{"name":"彗星二二型(六三四空/熟練)","type":[3,5,7,7,16],"seek":2}
,293:{"name":"12cm単装砲改二","type":[1,1,1,1,0],"seek":0}
,294:{"name":"12.7cm連装砲A型改二","type":[1,1,1,1,0],"seek":0}
,295:{"name":"12.7cm連装砲A型改三(戦時改修)+高射装置","type":[1,1,1,16,0],"seek":0}
,296:{"name":"12.7cm連装砲B型改四(戦時改修)+高射装置","type":[1,1,1,16,0],"seek":0}
,297:{"name":"12.7cm連装砲A型","type":[1,1,1,1,0],"seek":0}
,298:{"name":"16inch Mk.I三連装砲","type":[1,1,3,3,0],"seek":0}
,299:{"name":"16inch Mk.I三連装砲+AFCT改","type":[1,1,3,3,0],"seek":0}
,300:{"name":"16inch Mk.I三連装砲改+FCR type284","type":[1,1,3,3,0],"seek":0}
,301:{"name":"20連装7inch UP Rocket Launchers","type":[4,29,21,15,0],"seek":0}
,302:{"name":"九七式艦攻(九三一空/熟練)","type":[3,5,8,8,1],"seek":3}
,303:{"name":"Bofors 15.2cm連装砲 Model 1930","type":[1,1,2,2,0],"seek":0}
,304:{"name":"S9 Osprey","type":[5,7,10,10,28],"seek":4}
,305:{"name":"Ju87C改二(KMX搭載機)","type":[3,5,7,7,14],"seek":2}
,306:{"name":"Ju87C改二(KMX搭載機/熟練)","type":[3,5,7,7,14],"seek":2}
,307:{"name":"GFCS Mk.37","type":[5,8,12,11,0],"seek":6}
,308:{"name":"5inch単装砲 Mk.30改+GFCS Mk.37","type":[1,1,1,16,0],"seek":3}
,309:{"name":"甲標的 丙型","type":[2,4,22,5,0],"seek":0}
,310:{"name":"14cm連装砲改","type":[1,1,2,2,0],"seek":0}
,313:{"name":"5inch単装砲 Mk.30改","type":[1,1,1,16,0],"seek":0}
,314:{"name":"533mm五連装魚雷(初期型)","type":[2,3,5,5,0],"seek":0}
,315:{"name":"SG レーダー(初期型)","type":[5,8,12,11,0],"seek":8}
,316:{"name":"Re.2001 CB改","type":[3,5,7,7,14],"seek":0}
,317:{"name":"三式弾改","type":[4,28,18,12,0],"seek":0}
,318:{"name":"41cm連装砲改二","type":[1,1,3,3,0],"seek":0}
,319:{"name":"彗星一二型(六三四空/三号爆弾搭載機)","type":[3,5,7,7,16],"seek":0}
,320:{"name":"彗星一二型(三一号光電管爆弾搭載機)","type":[3,5,7,7,16],"seek":0}
,322:{"name":"瑞雲改二(六三四空)","type":[5,43,11,10,32],"seek":7}
,323:{"name":"瑞雲改二(六三四空/熟練)","type":[5,43,11,10,32],"seek":8}
,324:{"name":"オ号観測機改","type":[3,15,25,21,53],"seek":0}
,325:{"name":"オ号観測機改二","type":[3,15,25,21,53],"seek":1}
,326:{"name":"S-51J","type":[3,44,25,21,53],"seek":3}
,327:{"name":"S-51J改","type":[3,44,25,21,53],"seek":4}
,328:{"name":"35.6cm連装砲改","type":[1,1,3,3,0],"seek":0}
,329:{"name":"35.6cm連装砲改二","type":[1,1,3,3,0],"seek":0}
,330:{"name":"16inch Mk.I連装砲","type":[1,1,3,3,0],"seek":0}
,331:{"name":"16inch Mk.V連装砲","type":[1,1,3,3,0],"seek":0}
,332:{"name":"16inch Mk.VIII連装砲改","type":[1,1,3,3,0],"seek":0}
,335:{"name":"烈風改(試製艦載型)","type":[3,5,6,6,34],"seek":0}
,336:{"name":"烈風改二","type":[3,5,6,6,34],"seek":0}
,337:{"name":"烈風改二(一航戦/熟練)","type":[3,5,6,6,34],"seek":0}
,338:{"name":"烈風改二戊型","type":[3,5,6,45,34],"seek":1}
,339:{"name":"烈風改二戊型(一航戦/熟練)","type":[3,5,6,45,34],"seek":1}
,340:{"name":"152mm/55 三連装速射砲","type":[1,1,2,2,0],"seek":0}
,341:{"name":"152mm/55 三連装速射砲改","type":[1,1,2,2,0],"seek":0}
,342:{"name":"流星改(一航戦)","type":[3,5,8,8,33],"seek":4}
,343:{"name":"流星改(一航戦/熟練)","type":[3,5,8,8,33],"seek":6}
,344:{"name":"九七式艦攻改 試製三号戊型(空六号電探改装備機)","type":[3,5,8,46,11],"seek":4}
,345:{"name":"九七式艦攻改(熟練) 試製三号戊型(空六号電探改装備機)","type":[3,5,8,46,11],"seek":5}
,346:{"name":"二式12cm迫撃砲改","type":[7,32,15,17,0],"seek":0}
,347:{"name":"二式12cm迫撃砲改 集中配備","type":[7,32,15,17,0],"seek":0}
,348:{"name":"艦載型 四式20cm対地噴進砲","type":[15,26,37,31,0],"seek":0}
,349:{"name":"四式20cm対地噴進砲 集中配備","type":[15,26,37,31,0],"seek":0}
,353:{"name":"Fw190 A-5改(熟練)","type":[3,5,6,6,37],"seek":0}
,355:{"name":"M4A1 DD","type":[8,45,24,20,0],"seek":0}
,356:{"name":"8inch三連装砲 Mk.9","type":[1,1,2,2,0],"seek":0}
,357:{"name":"8inch三連装砲 Mk.9 mod.2","type":[1,1,2,2,0],"seek":0}
,358:{"name":"5inch 単装高角砲群","type":[1,2,4,16,0],"seek":0}
,359:{"name":"6inch 連装速射砲 Mk.XXI","type":[1,1,2,2,0],"seek":0}
,360:{"name":"Bofors 15cm連装速射砲 Mk.9 Model 1938","type":[1,1,2,2,0],"seek":0}
,361:{"name":"Bofors 15cm連装速射砲 Mk.9改+単装速射砲 Mk.10改 Model 1938","type":[1,1,2,2,0],"seek":0}
,362:{"name":"5inch連装両用砲(集中配備)","type":[1,1,2,16,0],"seek":0}
,363:{"name":"GFCS Mk.37+5inch連装両用砲(集中配備)","type":[1,1,2,16,0],"seek":3}
,364:{"name":"甲標的 丁型改(蛟龍改)","type":[2,4,22,5,0],"seek":2}
,365:{"name":"一式徹甲弾改","type":[4,25,19,13,0],"seek":0}
,366:{"name":"12.7cm連装砲D型改三","type":[1,1,1,1,0],"seek":0}
,367:{"name":"Swordfish(水上機型)","type":[5,43,11,10,28],"seek":2}
,368:{"name":"Swordfish Mk.III改(水上機型)","type":[5,43,11,10,28],"seek":3}
,369:{"name":"Swordfish Mk.III改(水上機型/熟練)","type":[5,43,11,10,28],"seek":4}
,370:{"name":"Swordfish Mk.II改(水偵型)","type":[5,7,10,10,28],"seek":5}
,371:{"name":"Fairey Seafox改","type":[5,7,10,10,28],"seek":6}
,372:{"name":"天山一二型甲","type":[3,5,8,8,1],"seek":2}
,373:{"name":"天山一二型甲改(空六号電探改装備機)","type":[3,5,8,46,1],"seek":5}
,374:{"name":"天山一二型甲改(熟練/空六号電探改装備機)","type":[3,5,8,46,1],"seek":6}
,375:{"name":"XF5U","type":[3,5,6,6,38],"seek":1}
,376:{"name":"533mm五連装魚雷(後期型)","type":[2,3,5,5,0],"seek":0}
,377:{"name":"RUR-4A Weapon Alpha改","type":[7,32,15,17,0],"seek":0}
,378:{"name":"対潜短魚雷(試作初期型)","type":[7,32,15,17,0],"seek":0}
,379:{"name":"12.7cm単装高角砲改二","type":[1,1,1,16,0],"seek":0}
,380:{"name":"12.7cm連装高角砲改二","type":[1,1,1,16,0],"seek":0}
,381:{"name":"16inch三連装砲 Mk.6","type":[1,1,3,3,0],"seek":0}
,382:{"name":"12cm単装高角砲E型","type":[1,1,1,16,0],"seek":0}
,383:{"name":"後期型53cm艦首魚雷(8門)","type":[2,3,32,5,0],"seek":0}
,384:{"name":"後期型潜水艦搭載電探&逆探","type":[24,42,51,42,0],"seek":7}
,385:{"name":"16inch三連装砲 Mk.6 mod.2","type":[1,1,3,3,0],"seek":0}
,386:{"name":"6inch三連装速射砲 Mk.16","type":[1,1,2,2,0],"seek":0}
,387:{"name":"6inch三連装速射砲 Mk.16 mod.2","type":[1,1,2,2,0],"seek":0}
,389:{"name":"TBM-3W+3S","type":[3,5,8,46,39],"seek":10}
,390:{"name":"16inch三連装砲 Mk.6+GFCS","type":[1,1,3,3,0],"seek":0}
,391:{"name":"九九式艦爆二二型","type":[3,5,7,7,40],"seek":2}
,392:{"name":"九九式艦爆二二型(熟練)","type":[3,5,7,7,40],"seek":3}
,393:{"name":"120mm/50 連装砲 mod.1936","type":[1,1,1,1,0],"seek":0}
,394:{"name":"120mm/50 連装砲改 A.mod.1937","type":[1,1,1,1,0],"seek":0}
,395:{"name":"深山","type":[26,46,53,49,41],"seek":0}
,396:{"name":"深山改","type":[26,46,53,49,41],"seek":0}
,397:{"name":"現地改装12.7cm連装高角砲","type":[1,1,1,16,0],"seek":0}
,398:{"name":"現地改装10cm連装高角砲","type":[1,1,1,16,0],"seek":0}
,399:{"name":"6inch Mk.XXIII三連装砲","type":[1,1,2,2,0],"seek":0}
,400:{"name":"533mm 三連装魚雷(53-39型)","type":[2,3,5,5,0],"seek":0}
,402:{"name":"寒冷地装備&甲板要員","type":[13,23,35,29,0],"seek":0}
,407:{"name":"15.2cm連装砲改二","type":[1,1,2,2,0],"seek":0}
,408:{"name":"装甲艇(AB艇)","type":[8,47,24,20,0],"seek":1}
,409:{"name":"武装大発","type":[8,47,24,20,0],"seek":0}
,410:{"name":"21号対空電探改二","type":[5,8,13,11,0],"seek":7}
,411:{"name":"42号対空電探改二","type":[5,8,13,11,0],"seek":6}
,412:{"name":"水雷戦隊 熟練見張員","type":[16,27,39,32,0],"seek":2}
,413:{"name":"精鋭水雷戦隊 司令部","type":[12,22,34,28,0],"seek":1}
,414:{"name":"SOC Seagull","type":[5,7,10,10,43],"seek":4}
,415:{"name":"SO3C Seamew改","type":[5,7,10,10,43],"seek":7}
,419:{"name":"SBD-5","type":[3,5,7,7,21],"seek":3}
,420:{"name":"SB2C-3","type":[3,5,7,7,21],"seek":3}
,421:{"name":"SB2C-5","type":[3,5,7,7,21],"seek":4}
,422:{"name":"FR-1 Fireball","type":[3,5,6,6,21],"seek":0}
,423:{"name":"Fulmar(戦闘偵察/熟練)","type":[5,7,9,9,14],"seek":4}
,424:{"name":"Barracuda Mk.II","type":[3,5,8,8,44],"seek":2}
,425:{"name":"Barracuda Mk.III","type":[3,5,8,8,44],"seek":3}
,426:{"name":"305mm/46 連装砲","type":[1,1,3,3,0],"seek":0}
,427:{"name":"305mm/46 三連装砲","type":[1,1,3,3,0],"seek":0}
,428:{"name":"320mm/44 連装砲","type":[1,1,3,3,0],"seek":0}
,429:{"name":"320mm/44 三連装砲","type":[1,1,3,3,0],"seek":0}
,430:{"name":"65mm/64 単装速射砲改","type":[1,2,4,16,0],"seek":0}
,434:{"name":"Corsair Mk.II","type":[3,5,6,6,46],"seek":1}
,435:{"name":"Corsair Mk.II(Ace)","type":[3,5,6,6,46],"seek":2}
,436:{"name":"大発動艇(II号戦車/北アフリカ仕様)","type":[8,14,24,20,0],"seek":0}
,437:{"name":"試製 陣風","type":[3,5,6,6,34],"seek":0}
,438:{"name":"三式水中探信儀改","type":[7,10,14,18,0],"seek":0}
,439:{"name":"Hedgehog(初期型)","type":[7,32,15,17,0],"seek":0}
,440:{"name":"21inch艦首魚雷発射管6門(初期型)","type":[2,3,32,5,0],"seek":0}
,441:{"name":"21inch艦首魚雷発射管6門(後期型)","type":[2,3,32,5,0],"seek":0}
,442:{"name":"潜水艦後部魚雷発射管4門(初期型)","type":[2,3,32,5,0],"seek":0}
,443:{"name":"潜水艦後部魚雷発射管4門(後期型)","type":[2,3,32,5,0],"seek":0}
,447:{"name":"零式艦戦64型(複座KMX搭載機)","type":[3,5,7,7,12],"seek":3}
,449:{"name":"特大発動艇+一式砲戦車","type":[8,14,24,20,0],"seek":0}
,450:{"name":"13号対空電探改(後期型)","type":[5,8,12,11,0],"seek":5}
,451:{"name":"三式指揮連絡機改","type":[3,16,26,22,54],"seek":2}
,453:{"name":"キ102乙","type":[22,38,47,48,47],"seek":0}
,454:{"name":"キ102乙改+イ号一型乙 誘導弾","type":[22,38,47,48,47],"seek":0}
,455:{"name":"試製 長12.7cm連装砲A型改四","type":[1,1,1,1,0],"seek":0}
,456:{"name":"SG レーダー(後期型)","type":[5,8,12,11,0],"seek":9}
,457:{"name":"後期型艦首魚雷(4門)","type":[2,3,32,5,0],"seek":0}
,458:{"name":"後期型電探&逆探+シュノーケル装備","type":[24,42,51,42,0],"seek":6}
,460:{"name":"15m二重測距儀改+21号電探改二+熟練射撃指揮所","type":[5,8,13,11,0],"seek":8}
,461:{"name":"熟練聴音員+後期型艦首魚雷(4門)","type":[2,3,32,5,0],"seek":0}
,463:{"name":"15.5cm三連装副砲改二","type":[1,2,4,4,0],"seek":0}
,464:{"name":"10cm連装高角砲群 集中配備","type":[1,2,4,16,0],"seek":0}
,465:{"name":"試製51cm三連装砲","type":[1,1,3,3,0],"seek":0}
,466:{"name":"流星改(熟練)","type":[3,5,8,8,33],"seek":5}
,467:{"name":"5inch連装砲(副砲配置) 集中配備","type":[1,2,4,16,0],"seek":0}
,468:{"name":"38cm四連装砲改 deux","type":[1,1,3,3,0],"seek":0}
,469:{"name":"零式水上偵察機11型乙改(夜偵)","type":[5,7,10,50,2],"seek":5}
,470:{"name":"12.7cm連装砲C型改三","type":[1,1,1,1,0],"seek":0}
,471:{"name":"Loire 130M","type":[5,7,10,50,49],"seek":3}
,472:{"name":"Mk.32 対潜魚雷(Mk.2落射機)","type":[7,32,15,17,0],"seek":0}
,473:{"name":"F4U-2 Night Corsair","type":[3,5,6,45,50],"seek":2}
,474:{"name":"F4U-4","type":[3,5,7,7,50],"seek":2}
,475:{"name":"AU-1","type":[3,5,7,7,50],"seek":2}
,476:{"name":"F4U-7","type":[3,5,7,7,50],"seek":2}
,477:{"name":"熟練甲板要員","type":[13,23,35,29,0],"seek":1}
,478:{"name":"熟練甲板要員+航空整備員","type":[13,23,35,29,0],"seek":1}
,481:{"name":"Mosquito TR Mk.33","type":[3,5,8,8,51],"seek":6}
,482:{"name":"特大発動艇+Ⅲ号戦車(北アフリカ仕様)","type":[8,14,24,20,0],"seek":0}
,483:{"name":"三式弾改二","type":[4,28,18,12,0],"seek":0}
,485:{"name":"強風改二","type":[5,36,45,43,26],"seek":2}
,486:{"name":"零式艦戦64型(制空戦闘機仕様)","type":[3,5,6,6,12],"seek":1}
,487:{"name":"零式艦戦64型(熟練爆戦)","type":[3,5,7,7,12],"seek":2}
,488:{"name":"二式爆雷改二","type":[7,32,15,17,0],"seek":0}
,489:{"name":"一式戦 隼II型改(20戦隊)","type":[3,16,26,22,52],"seek":0}
,490:{"name":"試製 夜間瑞雲(攻撃装備)","type":[5,43,11,51,32],"seek":7}
,491:{"name":"一式戦 隼III型改(熟練/20戦隊)","type":[3,16,26,22,52],"seek":0}
,492:{"name":"零戦52型丙(八幡部隊)","type":[3,5,6,6,12],"seek":0}
,494:{"name":"特大発動艇+チハ","type":[8,14,24,20,0],"seek":0}
,495:{"name":"特大発動艇+チハ改","type":[8,14,24,20,0],"seek":0}
,496:{"name":"陸軍歩兵部隊","type":[27,48,52,52,0],"seek":0}
,497:{"name":"九七式中戦車(チハ)","type":[27,48,52,52,0],"seek":0}
,498:{"name":"九七式中戦車 新砲塔(チハ改)","type":[27,48,52,52,0],"seek":0}
,499:{"name":"陸軍歩兵部隊+チハ改","type":[27,48,52,52,0],"seek":0}
,500:{"name":"発煙装置(煙幕)","type":[28,49,54,54,0],"seek":0}
,501:{"name":"発煙装置改(煙幕)","type":[28,49,54,54,0],"seek":0}
,502:{"name":"35.6cm連装砲改三(ダズル迷彩仕様)","type":[1,1,3,3,0],"seek":0}
,503:{"name":"35.6cm連装砲改四","type":[1,1,3,3,0],"seek":0}
,505:{"name":"25mm対空機銃増備","type":[4,6,21,15,0],"seek":0}
,506:{"name":"電探装備マスト(13号改+22号電探改四)","type":[5,8,12,11,0],"seek":5}
,507:{"name":"14inch/45 連装砲","type":[1,1,3,3,0],"seek":0}
,508:{"name":"14inch/45 三連装砲","type":[1,1,3,3,0],"seek":0}
,509:{"name":"12cm単装高角砲E型改","type":[1,1,1,16,0],"seek":0}
,510:{"name":"Walrus","type":[5,7,10,50,49],"seek":4}
,511:{"name":"21inch艦首魚雷発射管4門(初期型)","type":[2,3,32,5,0],"seek":0}
,512:{"name":"21inch艦首魚雷発射管4門(後期型)","type":[2,3,32,5,0],"seek":0}
,513:{"name":"阻塞気球","type":[29,50,54,55,0],"seek":0}
,514:{"name":"特大発動艇+Ⅲ号戦車J型","type":[8,14,24,20,0],"seek":0}
,515:{"name":"Sea Otter","type":[5,7,10,50,49],"seek":5}
,517:{"name":"逆探(E27)+22号対水上電探改四(後期調整型)","type":[5,8,12,11,0],"seek":8}
,518:{"name":"14cm連装砲改二","type":[1,1,2,2,0],"seek":0}
,519:{"name":"SJレーダー+潜水艦司令塔装備","type":[24,42,51,42,0],"seek":7}
,520:{"name":"試製20.3cm(4号)連装砲","type":[1,1,2,2,0],"seek":0}
,521:{"name":"紫雲(熟練)","type":[5,7,10,10,2],"seek":9}
,524:{"name":"12cm単装高角砲＋25mm機銃増備","type":[1,2,4,16,0],"seek":0}
,525:{"name":"特四式内火艇","type":[20,37,46,36,0],"seek":0}
,526:{"name":"特四式内火艇改","type":[20,37,46,36,0],"seek":0}
,522:{"name":"零式水上偵察機","type":[5,7,10,10,2],"seek":3}
,523:{"name":"零式水上偵察機(熟練)","type":[5,7,10,10,2],"seek":4}
,527:{"name":"Type281 レーダー","type":[5,8,13,11,0],"seek":8}
,528:{"name":"Type274 射撃管制レーダー","type":[5,8,13,11,0],"seek":5}
,529:{"name":"12.7cm連装砲C型改三H","type":[1,1,1,1,0],"seek":0}
,530:{"name":"35.6cm連装砲改三丙","type":[1,1,3,3,0],"seek":0}
,531:{"name":"艦隊通信アンテナ","type":[12,22,34,28,0],"seek":1}
,532:{"name":"通信装置&要員","type":[12,22,34,28,0],"seek":1}
,533:{"name":"10cm連装高角砲改+高射装置改","type":[1,1,1,16,0],"seek":0}
,534:{"name":"13.8cm連装砲","type":[1,1,1,16,0],"seek":0}
,535:{"name":"13.8cm連装砲改","type":[1,1,1,16,0],"seek":0}
,537:{"name":"15.2cm三連装主砲改","type":[1,1,2,2,0],"seek":0}
,538:{"name":"Loire 130M改(熟練)","type":[5,7,10,50,49],"seek":5}
,536:{"name":"15.2cm三連装主砲","type":[1,1,2,2,0],"seek":0}
,541:{"name":"SBD(Yellow Wings)","type":[3,5,7,7,50],"seek":2}
,542:{"name":"TBD(Yellow Wings)","type":[3,5,7,7,50],"seek":2}
,544:{"name":"SBD VB-2(爆撃飛行隊)","type":[3,5,7,7,50],"seek":2}
,545:{"name":"天山一二型甲改二(村田隊/電探装備)","type":[3,5,8,8,1],"seek":6}
,543:{"name":"SBD VS-2(偵察飛行隊)","type":[5,7,9,9,1],"seek":6}
,539:{"name":"SOC Seagull 後期型(熟練)","type":[5,7,10,10,43],"seek":7}
,540:{"name":"零式水上偵察機11型甲改二","type":[5,7,10,10,2],"seek":7}
,549:{"name":"三式指揮連絡機改二","type":[3,16,26,22,54],"seek":3}
,550:{"name":"試製 明星(増加試作機)","type":[3,5,7,7,16],"seek":1}
,551:{"name":"明星","type":[3,5,7,7,16],"seek":2}
,552:{"name":"九九式練爆二二型改(夜間装備実験機)","type":[3,5,7,7,16],"seek":4}
,553:{"name":"10cm連装高角砲改","type":[1,1,1,16,0],"seek":0}
};

export default equip_datas;